# Commands for menu
cmd_start_title = /старт
cmd_start_description = Добро пожаловать! Начните использовать список быстрых дел.

cmd_help_title = /помощь
cmd_help_description = Справочное сообщение о возможностях telegram бота.

# Buttons
btn_start_title = Старт
btn_add_task_title = Добавить задачу ➕
btn_delete_task_title = Удалить задачу ❌
btn_done_task_title = Выполнено ✅ | не выполнено 📌
btn_edit_task_title = Редактировать задачу ✏️
btn_update_list_title = Обновить список 🔄
btn_settings_title = Настройки ⚙️
btn_delete_all_title = Удалить все ❌
btn_save_title = Сохранить ✅
btn_cancel_title = Отменить ◀️
btn_back_title = Назад ◀️
btn_skip_title = Пропустить ⤵️

btn_languages_title = Языки 🌐
btn_language_en_US_title = Английский 🇺🇸
btn_language_ru_RU_title = Русский 🇷🇺

# Messages
task_list_title = СПИСОК ЗАДАЧ 📝
task_list_empty_message = У вас ещё нет задач.

add_task_message = Добавление новой задачи 🆕
                   Заголовок: { $title }
                   Описание: { $description }
add_task_enter_title = Введите заголовок новой задачи:
add_task_enter_description = Введите описание новой задачи:
add_task_confirm = Сохранить новую задачу?

input_error_message = Введённые данные не корректны!

settings_title = Настройки бота ⚙️
settings_languages_title = Выберите язык для бота из доступных.
error_message = Такое сообщение не может быть обработано, воспользуйтесь меню.
