# Commands for menu
cmd_start_title = /старт
cmd_start_description = Добро пожаловать! Начните использовать список быстрых дел.

cmd_help_title = /помощь
cmd_help_description = Справочное сообщение о возможностях telegram бота.

# Buttons
btn_add_task_title = Добавить задачу ➕
btn_delete_task_title = Удалить задачу ❌
btn_done_task_title = Выполнено ✅ | не выполнено 📌
btn_edit_task_title = Редактировать задачу ✏️
btn_update_list_title = Обновить список 🔄
btn_settings_title = Настройки ⚙️
btn_delete_all_title = Удалить все ❌
btn_save_title = Сохранить ✅
btn_cancel_title = Отменить ◀️

# Messages
task_list_title = У вас ещё нет задач.
error_message = Такое сообщение не может быть обработано, воспользуйтесь меню.
